<?php

namespace App\View\Components;

use Illuminate\View\Component;

class StoryMobile extends Component
{
    public $title;
    public $items;

    /**
     * StoryWeb constructor.
     * @param $title
     * @param $items
     */
    public function __construct($title = null, $items = null)
    {
        $this->title = "فرآیند توسعه اپلیکیشن";

        $this->items = [
            [
                "title" => ["تخمین و برآورد"],
                "body" => "ما نیازهای شما را برای مواجهه با چالش جمع آوری و تحلیل می کنیم و با توجه به جدول زمانی و بودجه بهترین راه حل را ارائه می دهیم. به محض اینکه ویژگی ها و طراحی برنامه اصلی مشخص شد و توافقات لازم حاصل گشت، آماده هستیم تا سفر را شروع کنیم.",
                "image" => "assets/images/story/data-1.jpg",
            ],

            [
                "title" => [" نمونه اولیه "," قابل کلیک"],
                "body" => "براساس تجربه ای که پس از مرحله اول به دست آورده ایم ، به ساخت نمونه های اولیه قابل کلیک می پردازیم. ما مطمئن خواهیم شد که طراحی UI / UX محصول نهایی، بهترین انتخاب شما بوده است.",
                "image" => "assets/images/story/data-2.jpg",
            ],

            [

                "title" => ["توسعه اپلیکیشن"],
                "body" => "طراحی ارتباط نزدیکی با روند توسعه دارد. ما توسعه را به بخش های کوچکتر تقسیم می کنیم تا به ما فرصتی دهد نتایج کار را پس از اتمام هر بخش به شما نشان دهیم و نظرات شما را در هر بخش بدست آوریم.",
                "image" => "assets/images/story/data-3.jpg",
            ],

            [

                "title" => ["تست"],
                "body" => "فرآیند تست برای اطمینان از رسیدن به نسخه ای بی نقص ضروری است. تیم متخصصان ما وظیفه رفع ایرادات و نقص های احتمالی را بر عهده دارند. آن ها وظیفه دارند اطمینان حاصل کنند تا اپلیکیشن شما مانند ساعت کار می کند.",
                "image" => "assets/images/story/data-4.jpg",
            ],

            [

                "title" => ["عرضه عمومی"],
                "body" => "پس از تمام کارها ، ما آماده هستیم تا محصول شما را به جهانیان نشان دهیم و لذت بخش ترین تجربه کاربری را برای مشتریان خود تحویل دهیم.",
                "image" => "assets/images/story/data-5.jpg",
            ],

            [

                "title" => ["پشتیبانی"],
                "body" => "پس از انتشار محصول ، ما از برنامه شما پشتیبانی می کنیم تا نیازهای کاربران نهایی را در آینده برآورده کنیم. تیم ما در هر زمان با شما در تماس است و آماده کمک به هر مسئله ای می باشد.",
                "image" => "assets/images/story/data-5.jpg",
            ],

        ];


    }

    public function render()
    {
        return view('components.story-mobile');
    }
}
